status/2022/1014.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>08 October 2022 - 14 October 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">08 October 2022 - 14 October 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ba99a4">1. MIT OCW</a>
<ul>
<li><a href="#org14703fa">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orge24ee1d">1.1.1. Practice Exam 4</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2b2e883">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org7315d90">2.1. Done.</a></li>
</ul>
</li>
<li><a href="#org199a46b">3. Mill Controller #2</a>
<ul>
<li><a href="#org774d7cd">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#orgb0028aa">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org4a26703">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org63e357a">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf6c2194">4. Alum Rock Data Center</a>
<ul>
<li><a href="#orgbaf4a86">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orgdd29cbf">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org0cb6188">5. OLPC</a>
<ul>
<li><a href="#org5eee3b9">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgf3302b2">6. Virtual Orchestra</a>
<ul>
<li><a href="#org18366db">6.1. sfz file tests</a>
<ul>
<li><a href="#org575d55d">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org7cf88a1">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#orga972a63">7. gat</a>
<ul>
<li><a href="#org45f54d2">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#orgd39e806">8. marble computing</a>
<ul>
<li><a href="#org2f20f3b">8.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#org2f9698a">8.1.1. Platform</a></li>
<li><a href="#orga3470b4">8.1.2. Ball sensor</a></li>
<li><a href="#orge1bdf9f">8.1.3. Display</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0323d0e">9. small graphics display</a>
<ul>
<li><a href="#orgc507866">9.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#org29ca55b">9.2. BWIF (Barely Working Image Format) designed</a></li>
<li><a href="#org013a389">9.3. pamtobwif/bwiftopam mostly complete</a></li>
</ul>
</li>
<li><a href="#orgcaf8feb">10. mcd05 32 button/led box</a>
<ul>
<li><a href="#org16c27ea">10.1. Recovered schematics.</a></li>
<li><a href="#org5ef01a3">10.2. Planning software.</a></li>
<li><a href="#org93996c2">10.3. Will switch controller to Nucleo144 with Ethernet.</a></li>
</ul>
</li>
<li><a href="#org48b9535">11. More project ideas</a>
<ul>
<li><a href="#orgd7d5efd">11.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org62aafe0">11.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#org48619a6">11.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org4f691d2">11.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org5fb6d32">11.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org1c51bec">11.3. GMPASM assembler</a></li>
<li><a href="#org0dd4a6b">11.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org1c9ce7d">11.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgbf324be">11.5.1. Offline compilation</a></li>
<li><a href="#org0645e00">11.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#orgcd3ab34">11.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org6c194ad">11.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org350738b">11.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org528d57b">11.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#orgc0ebd01">11.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
</ul>
</li>
<li><a href="#org1ba0ee0">11.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org4643064">11.7.1. OSI Superboard</a></li>
<li><a href="#org32e471e">11.7.2. Super Jolt</a></li>
<li><a href="#org458154d">11.7.3. Ampro Little Board</a></li>
<li><a href="#orgb69faae">11.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#org26d562d">11.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf97c9e8">12. David Davies</a>
<ul>
<li><a href="#org9469da6">12.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orga313193">12.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orga149b28">12.3. Next hearing 10/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5ba99a4" class="outline-2">
<h2 id="org5ba99a4"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org14703fa" class="outline-3">
<h3 id="org14703fa"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge24ee1d" class="outline-4">
<h4 id="orge24ee1d"><span class="section-number-4">1.1.1.</span> Practice Exam 4</h4>
</div>
</div>
</div>
<div id="outline-container-org2b2e883" class="outline-2">
<h2 id="org2b2e883"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7315d90" class="outline-3">
<h3 id="org7315d90"><span class="section-number-3">2.1.</span> Done.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Gets only KSCO in SCZ.
Need to test in SJ.
</p>
</div>
</div>
</div>
<div id="outline-container-org199a46b" class="outline-2">
<h2 id="org199a46b"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org774d7cd" class="outline-3">
<h3 id="org774d7cd"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-orgb0028aa" class="outline-3">
<h3 id="orgb0028aa"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org4a26703" class="outline-4">
<h4 id="org4a26703"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org63e357a" class="outline-4">
<h4 id="org63e357a"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf6c2194" class="outline-2">
<h2 id="orgf6c2194"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgbaf4a86" class="outline-3">
<h3 id="orgbaf4a86"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orgdd29cbf" class="outline-3">
<h3 id="orgdd29cbf"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org0cb6188" class="outline-2">
<h2 id="org0cb6188"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5eee3b9" class="outline-3">
<h3 id="org5eee3b9"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgf3302b2" class="outline-2">
<h2 id="orgf3302b2"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org18366db" class="outline-3">
<h3 id="org18366db"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org575d55d" class="outline-4">
<h4 id="org575d55d"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org7cf88a1" class="outline-3">
<h3 id="org7cf88a1"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-orga972a63" class="outline-2">
<h2 id="orga972a63"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org45f54d2" class="outline-3">
<h3 id="org45f54d2"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-orgd39e806" class="outline-2">
<h2 id="orgd39e806"><span class="section-number-2">8.</span> marble computing</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org2f20f3b" class="outline-3">
<h3 id="org2f20f3b"><span class="section-number-3">8.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org2f9698a" class="outline-4">
<h4 id="org2f9698a"><span class="section-number-4">8.1.1.</span> Platform</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Works!
</p>
</div>
</div>
<div id="outline-container-orga3470b4" class="outline-4">
<h4 id="orga3470b4"><span class="section-number-4">8.1.2.</span> Ball sensor</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Clairex CdS not sensitive enough. Investigating alternatives.
</p>
</div>
</div>
<div id="outline-container-orge1bdf9f" class="outline-4">
<h4 id="orge1bdf9f"><span class="section-number-4">8.1.3.</span> Display</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Pins resoldered. Needs testing.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org0323d0e" class="outline-2">
<h2 id="org0323d0e"><span class="section-number-2">9.</span> small graphics display</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgc507866" class="outline-3">
<h3 id="orgc507866"><span class="section-number-3">9.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
</div>
<div id="outline-container-org29ca55b" class="outline-3">
<h3 id="org29ca55b"><span class="section-number-3">9.2.</span> BWIF (Barely Working Image Format) designed</h3>
</div>
<div id="outline-container-org013a389" class="outline-3">
<h3 id="org013a389"><span class="section-number-3">9.3.</span> pamtobwif/bwiftopam mostly complete</h3>
</div>
</div>
<div id="outline-container-orgcaf8feb" class="outline-2">
<h2 id="orgcaf8feb"><span class="section-number-2">10.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org16c27ea" class="outline-3">
<h3 id="org16c27ea"><span class="section-number-3">10.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org5ef01a3" class="outline-3">
<h3 id="org5ef01a3"><span class="section-number-3">10.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org93996c2" class="outline-3">
<h3 id="org93996c2"><span class="section-number-3">10.3.</span> Will switch controller to Nucleo144 with Ethernet.</h3>
</div>
</div>
<div id="outline-container-org48b9535" class="outline-2">
<h2 id="org48b9535"><span class="section-number-2">11.</span> More project ideas</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgd7d5efd" class="outline-3">
<h3 id="orgd7d5efd"><span class="section-number-3">11.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org62aafe0" class="outline-3">
<h3 id="org62aafe0"><span class="section-number-3">11.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-org48619a6" class="outline-4">
<h4 id="org48619a6"><span class="section-number-4">11.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org4f691d2" class="outline-4">
<h4 id="org4f691d2"><span class="section-number-4">11.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-11-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org5fb6d32" class="outline-4">
<h4 id="org5fb6d32"><span class="section-number-4">11.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org1c51bec" class="outline-3">
<h3 id="org1c51bec"><span class="section-number-3">11.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-11-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org0dd4a6b" class="outline-3">
<h3 id="org0dd4a6b"><span class="section-number-3">11.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org1c9ce7d" class="outline-3">
<h3 id="org1c9ce7d"><span class="section-number-3">11.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-orgbf324be" class="outline-4">
<h4 id="orgbf324be"><span class="section-number-4">11.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org0645e00" class="outline-4">
<h4 id="org0645e00"><span class="section-number-4">11.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-orgcd3ab34" class="outline-3">
<h3 id="orgcd3ab34"><span class="section-number-3">11.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-11-6">
</div>
<div id="outline-container-org6c194ad" class="outline-4">
<h4 id="org6c194ad"><span class="section-number-4">11.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org350738b" class="outline-4">
<h4 id="org350738b"><span class="section-number-4">11.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org528d57b" class="outline-4">
<h4 id="org528d57b"><span class="section-number-4">11.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgc0ebd01" class="outline-4">
<h4 id="orgc0ebd01"><span class="section-number-4">11.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
</div>
<div id="outline-container-org1ba0ee0" class="outline-3">
<h3 id="org1ba0ee0"><span class="section-number-3">11.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-11-7">
</div>
<div id="outline-container-org4643064" class="outline-4">
<h4 id="org4643064"><span class="section-number-4">11.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-11-7-1">
<p>
Unknown. Received composite to VGA adapter.
</p>
</div>
</div>
<div id="outline-container-org32e471e" class="outline-4">
<h4 id="org32e471e"><span class="section-number-4">11.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-11-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org458154d" class="outline-4">
<h4 id="org458154d"><span class="section-number-4">11.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-11-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orgb69faae" class="outline-4">
<h4 id="orgb69faae"><span class="section-number-4">11.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-11-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-org26d562d" class="outline-4">
<h4 id="org26d562d"><span class="section-number-4">11.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-11-7-5">
<p>
Works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf97c9e8" class="outline-2">
<h2 id="orgf97c9e8"><span class="section-number-2">12.</span> David Davies</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org9469da6" class="outline-3">
<h3 id="org9469da6"><span class="section-number-3">12.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orga313193" class="outline-3">
<h3 id="orga313193"><span class="section-number-3">12.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orga149b28" class="outline-3">
<h3 id="orga149b28"><span class="section-number-3">12.3.</span> Next hearing 10/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>